{
  "account": {
    "id_not_found_error": "No account was found with the given ID."
  },
  "app": {
    "title": "Glance"
  },
  "page_not_found": {
    "api_error_details": "We could not find the page \"{{path}}\".",
    "api_error_message": "Page not found",
    "heading": "Page not found",
    "message": "We could not find the above page.",
    "title": "Page not found"
  },
  "token": {
    "access_denied_error_description": "The resource owner or authorization server denied the request.",
    "invalid_client_error_description": "Client authentication failed. The client may be unknown, or client authentication is missing or invalid.",
    "invalid_grant_error_description": "The provided authorization grant (e.g., authorization code, resource owner credentials) or refresh token is invalid, expired, revoked, does not match the redirection URI used in the authorization request, or was issued to another client.",
    "invalid_request_error_description": "The request is missing a required parameter, includes an unsupported parameter value (other than grant type), repeats a parameter, includes multiple credentials, utilizes more than one mechanism for authenticating the client, or is otherwise malformed.",
    "invalid_scope_error_description": "The requested scope is invalid, unknown, malformed, or exceeds the scope granted by the resource owner.",
    "invalid_token_error_description": "The access token provided is expired, revoked, malformed, or invalid for other reasons.",
    "server_error_error_description": "The authorization server encountered an unexpected condition that prevented it from fulfilling the request.",
    "temporarily_unavailable_error_description": "The authorization server is currently unable to handle the request due to a temporary overloading or maintenance of the server.",
    "unauthorized_client_error_description": "The authenticated client is not authorized to use this authorization grant type.",
    "unsupported_authentication_method_error_description": "The authentication method is unsupported. If using the \"Authorization\" request header field, please check the \"WWW-Authenticate\" response header field for supported methods.",
    "unsupported_grant_type_error_description": "The authorization grant type is not supported by the authorization server."
  },
  "validation": {
    "invalid_parameter_error": "Parameter \"{{parameter}}\" in an unknown location is invalid.",
    "invalid_parameter_error_body": "Parameter \"{{parameter}}\" in the request body is invalid.",
    "invalid_parameter_error_cookies": "Parameter \"{{parameter}}\" in cookies is invalid.",
    "invalid_parameter_error_headers": "Parameter \"{{parameter}}\" in the request header is invalid.",
    "invalid_parameter_error_params": "Parameter \"{{parameter}}\" in the path is invalid.",
    "invalid_parameter_error_query": "Parameter \"{{parameter}}\" in the query string is invalid."
  }
}
